## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:117" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:117" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:940fc1325d4851570223407ca2ca60d1508e7fd0ae56062a53461e6394f1de8e" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:0b7d944349e60e0815761e6afe2111fa5b5f0dd2a207d10a68d8aa00743a8c23"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 117 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "a35f8e5d9898bb15a872dbfa891beeb5-6" -> "744634c3f1dc482a7d2f0daa8bb0c7fb"
        id                     = "graphql.744634c3f1dc482a7d2f0daa8bb0c7fb.zip"
        tags                   = {}
      ~ version_id             = "PQsojh4YX2LEjewn5SfEZoW7uF9lzGKJ" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "IFfhFYYqhNkPx3Bf1_y.npwrZOS9edx8" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.754b80dbdfcccbbd0c84a45b3a434ccb.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "98ec699984c1e3682a7e18e0afbe2307-4" -> "c85adebc93d333348a047b42a7fc7985"
      ~ id                     = "python.754b80dbdfcccbbd0c84a45b3a434ccb.zip" -> (known after apply)
      ~ key                    = "python.754b80dbdfcccbbd0c84a45b3a434ccb.zip" -> "python.c85adebc93d333348a047b42a7fc7985.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "754b80dbdfcccbbd0c84a45b3a434ccb" -> "c85adebc93d333348a047b42a7fc7985"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Q70nwA4zlHMlKJD3.531n05iihiPrJAh" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "fa0b0b8d222eb269de7cb945c0fb8ba4" -> "8cf511c38a59e115a8b7a43b35f5fa84"
        id                     = "dist/200.html"
      ~ source_hash            = "fa0b0b8d222eb269de7cb945c0fb8ba4" -> "8cf511c38a59e115a8b7a43b35f5fa84"
        tags                   = {}
      ~ version_id             = "MZDc6lgqhWFJl17xM.fW5XWx5p0u3qqw" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "75fdc7fc5f3d1050c1d1095ed2a42738" -> "4385ae7b713e4362dec32de1c5ca8cc9"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "75fdc7fc5f3d1050c1d1095ed2a42738" -> "4385ae7b713e4362dec32de1c5ca8cc9"
        tags                   = {}
      ~ version_id             = "EL7CYiHrNLuHS2YYtRi2khqauZns0g8c" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3d4d8228d739c2ba86a35a6f2f3953e3" -> "0f94ede75c6006562884873939acef5d"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "3d4d8228d739c2ba86a35a6f2f3953e3" -> "0f94ede75c6006562884873939acef5d"
        tags                   = {}
      ~ version_id             = "glyYFgw9BKLGDW2I0zM_PLm47RBW0RvL" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["deploy-config.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a1977cf2075fe7ab6577cc9eff57c0c7"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/deploy-config.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/deploy-config.js"
+       source_hash            = "a1977cf2075fe7ab6577cc9eff57c0c7"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "fa0b0b8d222eb269de7cb945c0fb8ba4" -> "8cf511c38a59e115a8b7a43b35f5fa84"
        id                     = "dist/index.html"
      ~ source_hash            = "fa0b0b8d222eb269de7cb945c0fb8ba4" -> "8cf511c38a59e115a8b7a43b35f5fa84"
        tags                   = {}
      ~ version_id             = "qNgxBbBZS5BG2VaWDjlOLTESDorKE_zt" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d59a21b61b1cc42702764173a35f9181"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js"
+       source_hash            = "d59a21b61b1cc42702764173a35f9181"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.9628a5f3.js"] will be destroyed
  # (because key ["static/js/app.9628a5f3.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.9628a5f3.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "2827d1300c35272929bd3c1d4312d8b9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.9628a5f3.js" -> null
-       key                    = "dist/static/js/app.9628a5f3.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.9628a5f3.js" -> null
-       source_hash            = "2827d1300c35272929bd3c1d4312d8b9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "n4iCbQ7oWDBxxnTGX4AnJ1_5Ovjdy44d" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.9628a5f3.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.9628a5f3.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.9628a5f3.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.9628a5f3.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.9628a5f3.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.9628a5f3.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "96JW3TdMM7Qksd4OrRK.w57K_.J6ZYht" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-26T16:33:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:84" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:84/invocations" -> (known after apply)
      ~ s3_key                         = "python.754b80dbdfcccbbd0c84a45b3a434ccb.zip" -> "python.c85adebc93d333348a047b42a7fc7985.zip"
        tags                           = {}
      ~ version                        = "84" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
              ~ "DD_TAGS"                      = "git.commit.sha:1f7d2f69acd4d400ae6df7d34d8da0aa1866a311,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:278f9bc46473e49b049b929f488ffb2786330c25,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "84" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:132" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:132/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "132" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
              ~ "DD_TAGS"                            = "git.commit.sha:1f7d2f69acd4d400ae6df7d34d8da0aa1866a311,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:278f9bc46473e49b049b929f488ffb2786330c25,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "132" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:40/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
              ~ "DD_TAGS"                            = "git.commit.sha:1f7d2f69acd4d400ae6df7d34d8da0aa1866a311,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:278f9bc46473e49b049b929f488ffb2786330c25,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "1f7d2f69acd4d400ae6df7d34d8da0aa1866a311" -> "278f9bc46473e49b049b929f488ffb2786330c25"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8851787430)*